In [4]:
!conda install -c conda-forge ipython-sql pymysql -y

Retrieving notices: done
Channels:
 - conda-forge
 - defaults
Platform: osx-64
Collecting package metadata (repodata.json): done
Solving environment: done

## Package Plan ##

  environment location: /opt/anaconda3

  added / updated specs:
    - ipython-sql
    - pymysql


The following packages will be downloaded:

    package                    |            build
    ---------------------------|-----------------
    ipython-sql-0.3.9          |  pyhd8ed1ab_1004          18 KB  conda-forge
    prettytable-3.15.1         |     pyhd8ed1ab_0          34 KB  conda-forge
    pymysql-1.1.1              |     pyhd8ed1ab_1          43 KB  conda-forge
    sqlparse-0.5.3             |     pyhd8ed1ab_0          39 KB  conda-forge
    ------------------------------------------------------------
                                           Total:         135 KB

The following NEW packages will be INSTALLED:

  ipython-sql        conda-forge/noarch::ipython-sql-0.3.9-pyhd8ed1ab_1004
  prettytable        conda-forge/noarch::prettytable-3.15.1-pyhd8ed1ab_0
  pymysql            conda-forge/noarch::pymysql-1.1.1-pyhd8ed1ab_1
  sqlparse           conda-forge/noarch::sqlparse-0.5.3-pyhd8ed1ab_0



Downloading and Extracting Packages:
pymysql-1.1.1        | 43 KB     |                                       |   0%
sqlparse-0.5.3       | 39 KB     |                                       |   0%

prettytable-3.15.1   | 34 KB     |                                       |   0%


ipython-sql-0.3.9    | 18 KB     |                                       |   0%
sqlparse-0.5.3       | 39 KB     | ##############9                       |  41%
pymysql-1.1.1        | 43 KB     | ##################################### | 100%
pymysql-1.1.1        | 43 KB     | ##################################### | 100%

prettytable-3.15.1   | 34 KB     | #################4                    |  47%

prettytable-3.15.1   | 34 KB     | ##################################### | 100%

prettytable-3.15.1   | 34 KB     | ##################################### | 100%


ipython-sql-0.3.9    | 18 KB     | ################################2     |  87%


ipython-sql-0.3.9    | 18 KB     | ##################################### | 100%









Preparing transaction: done
Verifying transaction: done
Executing transaction: done

In [1]:
%load_ext sql
%rsql mysql+pymysql://root:12345678@127.0.0.1/ecommerce

UsageError: Line magic function `%rsql` not found.

In [4]:
%reload_ext sql

In [5]:
from sqlalchemy import create_engine

DATABASE_URI = "mysql+pymysql://root:12345678@127.0.0.1/ecommerce"
engine = create_engine(DATABASE_URI)

# Use this for SQL magic
%sql $DATABASE_URI

MetaData.__init__() got an unexpected keyword argument 'bind'
Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys([])

In [6]:
import pandas as pd
import mysql.connector
from IPython.display import display, Markdown

# ðŸ”¹ Connect to MySQL database
db = mysql.connector.connect(
    host="localhost",
    user="root",
    password="12345678",  
    database="ecommerce"
)

# ðŸ”¹ Create a cursor object
cur = db.cursor()

In [7]:
%load_ext sql
%sql mysql+pymysql://root:12345678@127.0.0.1/ecommerce

The sql extension is already loaded. To reload it, use:
  %reload_ext sql
MetaData.__init__() got an unexpected keyword argument 'bind'
Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys([])

In [8]:
import pandas as pd

query = "SELECT * FROM customers LIMIT 5"
df = pd.read_sql(query, engine)
df

,customer_id,customer_unique_id,customer_zip_code_prefix,customer_city,customer_state
0,06b8999e2fba1a1fbc88172c00ba8bc7,861eff4711a542e4b93843c6dd7febb0,14409,franca,SP
1,18955e83d337fd6b2def6b18a428ac77,290c77bc529b7ac935b93aa66c333dc3,9790,sao bernardo do campo,SP
2,4e7b3e00288586ebd08712fdd0374a03,060e732b5b29e8181a18229c7b0b2b5e,1151,sao paulo,SP
3,b2b6027bc5c5109e529d4dc6358b12c3,259dac757896d24d7702b9acbbff3f3c,8775,mogi das cruzes,SP
4,4f2d8ab171c80ec8364f7c12e35b23ad,345ecd01c38d18a9036ed96c73b8d066,13056,campinas,SP

In [9]:
display(Markdown("## List all unique cities where customers are located."))

query = """SELECT DISTINCT customer_city FROM customers"""
df = pd.read_sql(query, engine)
df

## List all unique cities where customers are located.

              customer_city
0                    franca
1     sao bernardo do campo
2                 sao paulo
3           mogi das cruzes
4                  campinas
...                     ...
4114                 siriji
4115    natividade da serra
4116           monte bonito
4117             sao rafael
4118      eugenio de castro

[4119 rows x 1 columns]

In [10]:
display(Markdown("## Count the number of orders placed in 2017."))

query = """
SELECT COUNT(*) AS total_orders 
FROM orders 
WHERE YEAR(order_purchase_timestamp) = 2017"""
df = pd.read_sql(query, engine)
df

## Count the number of orders placed in 2017.

   total_orders
0        225505

In [11]:
display(Markdown("## Percentage of orders paid in installments."))

query = """
SELECT 
    (SUM(CASE WHEN payment_installments > 1 THEN 1 ELSE 0 END) / COUNT(*)) * 100 AS installment_percentage
FROM payments
"""
cur.execute(query)
data = cur.fetchall()

df = pd.DataFrame(data, columns=["Installment Percentage"])
display(df)

## Percentage of orders paid in installments.

  Installment Percentage
0                49.4176

In [12]:
display(Markdown("## Count of customers from each state."))

query = """
SELECT customer_state, COUNT(*) AS total_customers
FROM customers
GROUP BY customer_state
"""
cur.execute(query)
data = cur.fetchall()

df = pd.DataFrame(data, columns=["State", "Total Customers"])
display(df)

## Count of customers from each state.

   State  Total Customers
0     SP           208730
1     SC            18185
2     MG            58175
3     PR            25225
4     RJ            64260
5     RS            27330
6     PA             4875
7     GO            10100
8     ES            10165
9     BA            16900
10    MA             3735
11    MS             3575
12    CE             6680
13    DF            10700
14    RN             2425
15    PE             8260
16    MT             4535
17    AM              740
18    AP              340
19    AL             2065
20    RO             1265
21    PB             2680
22    TO             1400
23    PI             2475
24    AC              405
25    SE             1750
26    RR              230

In [14]:
display(Markdown("## Average Order Value Per Customer"))

query = """
SELECT o.customer_id, AVG(p.payment_value) AS avg_order_value
FROM orders o
JOIN payments p ON o.order_id = p.order_id
GROUP BY o.customer_id;
"""

cur.execute(query)
data = cur.fetchall()

df = pd.DataFrame(data, columns=["Customer ID", "Avg Order Value"])
display(df)

## Average Order Value Per Customer

                            Customer ID  Avg Order Value
0      c69f8b33e62ecb30ff78ae46d7fb9241       135.509995
1      597950088114c1a9e2b27459051f40ff        57.680000
2      8458f7ae02bda5950ce48c01a720559a        20.750000
3      c0cc17e4ee16598f33ce7ccc36e3b4d0       183.649994
4      2c5491a76ec0a56db58282ea7ae70617       159.070007
...                                 ...              ...
99435  9d07ed48127e776f64b02de9aa00c136        39.000000
99436  9652611b6a6c44d8631be8f89e656867        77.570000
99437  c9722642f74a37fb4d28e4d5d65c20aa       155.229996
99438  a2ccdcdf92fa5b6f0cf2a320924ba362        33.560001
99439  d7475a536385854da614094f0bf12275       138.740005

[99440 rows x 2 columns]

In [15]:
display(Markdown("## Orders Per Month in 2018"))

query = """
SELECT DATE_FORMAT(order_purchase_timestamp, '%Y-%m') AS order_month, COUNT(*) AS total_orders
FROM orders
WHERE YEAR(order_purchase_timestamp) = 2018
GROUP BY order_month;
"""

cur.execute(query)
data = cur.fetchall()

df = pd.DataFrame(data, columns=["Month", "Total Orders"])
display(df)

## Orders Per Month in 2018

     Month  Total Orders
0  2018-07         31460
1  2018-08         32560
2  2018-02         33640
3  2018-06         30835
4  2018-03         36055
5  2018-01         36345
6  2018-05         34365
7  2018-04         34695
8  2018-09            80
9  2018-10            20

In [17]:
display(Markdown("## Average Payment per Order"))

query = """
SELECT o.order_id, AVG(p.payment_value) AS avg_payment
FROM orders o
JOIN payments p ON o.order_id = p.order_id
GROUP BY o.order_id;
"""

cur.execute(query)
data = cur.fetchall()

df = pd.DataFrame(data, columns=["Order ID", "Avg Payment"])
display(df)

## Average Payment per Order

                               Order ID  Avg Payment
0      8fc207e94fa91a7649c5a5dab690272a   135.509995
1      f26f92a3da58e9c771820a7b4d9a6800    57.680000
2      b616f638cd86d92c7cbd06cf7484ee34    20.750000
3      38c4ae942b818085578157aabd4abf9e   183.649994
4      aa466a92af916f9f68e56fce7d3a21b1   159.070007
...                                 ...          ...
99435  a7dfcc78536e420e85e510d7bb161cb4    39.000000
99436  79d7ad461229b660db59a892f1fa8e1b    77.570000
99437  9a5ea74a2fd85889e60e9bdb186cd1f0   155.229996
99438  1091b52a01d06a2bf1e97ca70cb2d75a    33.560001
99439  5bd233924f0b9c52492bd5a92e5ab2d3   138.740005

[99440 rows x 2 columns]

In [23]:
display(Markdown("## Customers Who Have Not Ordered in the Last 6 Months"))

query = """
SELECT c.customer_id
FROM customers c
LEFT JOIN orders o ON c.customer_id = o.customer_id
GROUP BY c.customer_id
HAVING MAX(o.order_purchase_timestamp) < DATE_SUB(CURDATE(), INTERVAL 6 MONTH);
"""

cur.execute(query)
data = cur.fetchall()

df = pd.DataFrame(data, columns=["Customer ID"])
display(df)

## Customers Who Have Not Ordered in the Last 6 Months

                            Customer ID
0      6e359a57a91f84095cc64e1b351aef8c
1      df0aa5b8586495e0ddf6b601122e43a1
2      df85b96ba2ce3e49bde101b1614f52ac
3      3ccb27f9c7ee205656acef98c19fc061
4      154e666b681104319714a99a3ab71e44
...                                 ...
99436  47274ab84d1b20ca707a3d849699e0b4
99437  371e25352587a8bf2f77b6739406281d
99438  86a1b4e2bb98478774726fae917521e2
99439  a072679ac4ac4d56f1aaff9e763836ed
99440  ec126b0b2593214b75ec14893b15d9e5

[99441 rows x 1 columns]

In [30]:
display(Markdown("## Percentage of Orders Paid Using Each Payment Method"))

query = """
SELECT p.payment_type, 
       COUNT(p.order_id) * 100.0 / (SELECT COUNT(*) FROM payments) AS percentage
FROM payments p
GROUP BY p.payment_type
ORDER BY percentage DESC;
"""

cur.execute(query)
data = cur.fetchall()

df = pd.DataFrame(data, columns=["Payment Method", "Percentage of Orders"])
display(df)

## Percentage of Orders Paid Using Each Payment Method

  Payment Method Percentage of Orders
0    credit_card             73.92238
1            UPI             19.04395
2        voucher              5.55898
3     debit_card              1.47181
4    not_defined              0.00289

In [18]:
display(Markdown("## Top 5 Customers by Number of Orders"))

query = """
SELECT o.customer_id, COUNT(o.order_id) AS total_orders
FROM orders o
GROUP BY o.customer_id
ORDER BY total_orders DESC
LIMIT 5;
"""

cur.execute(query)
data = cur.fetchall()

df = pd.DataFrame(data, columns=["Customer ID", "Total Orders"])
display(df)

## Top 5 Customers by Number of Orders

                        Customer ID  Total Orders
0  6c26b354ab5504cde0dc2acd7b5f43f4             5
1  16322e237a07158592862b5d6d91642d             5
2  45e81b9e07aa8660f88f592878641ff0             5
3  ac7a943dcc91b2da7960e8e8950f672c             5
4  ae3a3a6fd9128d8617e2cb3a88a7598b             5

In [20]:
display(Markdown("## Year-over-Year Growth Rate of Total Sales"))

query = """
SELECT YEAR(order_purchase_timestamp) AS year, 
       SUM(payment_value) AS total_sales,
       LAG(SUM(payment_value)) OVER (ORDER BY YEAR(order_purchase_timestamp)) AS prev_year_sales,
       (SUM(payment_value) - LAG(SUM(payment_value)) OVER (ORDER BY YEAR(order_purchase_timestamp))) / 
       LAG(SUM(payment_value)) OVER (ORDER BY YEAR(order_purchase_timestamp)) * 100 AS yoy_growth
FROM orders o
JOIN payments p ON o.order_id = p.order_id
GROUP BY YEAR(order_purchase_timestamp);
"""

cur.execute(query)
data = cur.fetchall()

df = pd.DataFrame(data, columns=["Year", "Total Sales", "Previous Year Sales", "YoY Growth (%)"])
display(df)

## Year-over-Year Growth Rate of Total Sales

   Year   Total Sales  Previous Year Sales  YoY Growth (%)
0  2016  8.904351e+05                  NaN             NaN
1  2017  1.087462e+08         8.904351e+05    12112.703760
2  2018  1.304964e+08         1.087462e+08       20.000924

In [21]:
display(Markdown("## Average Time Between Orders for Each Customer"))

query = """
WITH order_times AS (
    SELECT customer_id, order_purchase_timestamp,
           LAG(order_purchase_timestamp) OVER (PARTITION BY customer_id ORDER BY order_purchase_timestamp) AS prev_order_time
    FROM orders
)
SELECT customer_id, AVG(DATEDIFF(order_purchase_timestamp, prev_order_time)) AS avg_days_between_orders
FROM order_times
WHERE prev_order_time IS NOT NULL
GROUP BY customer_id;
"""

cur.execute(query)
data = cur.fetchall()

df = pd.DataFrame(data, columns=["Customer ID", "Avg Days Between Orders"])
display(df)

## Average Time Between Orders for Each Customer

                            Customer ID Avg Days Between Orders
0      00012a2ce6f8dcda20d059ce98491703                  0.0000
1      000161a058600d5901f007fab4c27140                  0.0000
2      0001fd6190edaaf884bcaf3d49edf079                  0.0000
3      0002414f95344307404f0ace7a26f1d5                  0.0000
4      000379cdec625522490c315e70c7a9fb                  0.0000
...                                 ...                     ...
99436  fffecc9f79fd8c764f843e9951b11341                  0.0000
99437  fffeda5b6d849fbd39689bb92087f431                  0.0000
99438  ffff42319e9b2d713724ae527742af25                  0.0000
99439  ffffa3172527f765de70084a7e53aae8                  0.0000
99440  ffffe8b65bbe3087b653a978c870db99                  0.0000

[99441 rows x 2 columns]

In [22]:
display(Markdown("## Cumulative Monthly Sales for Each Year"))

query = """
SELECT 
    YEAR(order_purchase_timestamp) AS year,
    MONTH(order_purchase_timestamp) AS month,
    SUM(payment_value) AS monthly_sales,
    SUM(SUM(payment_value)) OVER (PARTITION BY YEAR(order_purchase_timestamp) ORDER BY MONTH(order_purchase_timestamp)) AS cumulative_sales
FROM orders o
JOIN payments p ON o.order_id = p.order_id
GROUP BY year, month
ORDER BY year, month;
"""

cur.execute(query)
data = cur.fetchall()

df = pd.DataFrame(data, columns=["Year", "Month", "Monthly Sales", "Cumulative Sales"])
display(df)

## Cumulative Monthly Sales for Each Year

    Year  Month  Monthly Sales  Cumulative Sales
0   2016      9   3.783600e+03      3.783600e+03
1   2016     10   8.863572e+05      8.901408e+05
2   2016     12   2.943000e+02      8.904351e+05
3   2017      1   2.077321e+06      2.077321e+06
4   2017      2   4.378620e+06      6.455941e+06
5   2017      3   6.747954e+06      1.320389e+07
6   2017      4   6.266820e+06      1.947072e+07
7   2017      5   8.893782e+06      2.836450e+07
8   2017      6   7.669146e+06      3.603364e+07
9   2017      7   8.885744e+06      4.491939e+07
10  2017      8   1.011594e+07      5.503533e+07
11  2017      9   1.091644e+07      6.595177e+07
12  2017     10   1.169517e+07      7.764694e+07
13  2017     11   1.792324e+07      9.557018e+07
14  2017     12   1.317602e+07      1.087462e+08
15  2018      1   1.672506e+07      1.672506e+07
16  2018      2   1.488695e+07      3.161201e+07
17  2018      3   1.739478e+07      4.900679e+07
18  2018      4   1.741178e+07      6.641858e+07
19  2018      5   1.730973e+07      8.372831e+07
20  2018      6   1.535821e+07      9.908652e+07
21  2018      7   1.599811e+07      1.150846e+08
22  2018      8   1.533638e+07      1.304210e+08
23  2018      9   6.659310e+04      1.304876e+08
24  2018     10   8.845050e+03      1.304964e+08

In [38]:
display(Markdown("## Percentage of Repeat Customers"))

query = """
SELECT 
    (COUNT(DISTINCT CASE WHEN order_count > 1 THEN customer_id END) * 100.0 / COUNT(DISTINCT customer_id)) 
    AS repeat_customer_percentage
FROM (
    SELECT customer_id, COUNT(order_id) AS order_count
    FROM orders
    GROUP BY customer_id
) AS customer_orders;
"""

cur.execute(query)
data = cur.fetchall()

df = pd.DataFrame(data, columns=["Repeat Customer Percentage"])
display(df)

## Percentage of Repeat Customers

  Repeat Customer Percentage
0                  100.00000